# ----------------------------------------------------------------
#  RaspberryPiPico
#  RasPicoThermoMeter (ShiroNyaooon)
# ----------------------------------------------------------------
import utime
import machine

# ----------------------------------------------------------------
#  定義
# ----------------------------------------------------------------
# PIN_LED = Pin(25, Pin.OUT)

# ----------------------------------------------------------------
#  初期化処理
# ----------------------------------------------------------------
def init():
	pass

# ----------------------------------------------------------------
#  メイン処理
# ----------------------------------------------------------------
def main():

	# 温度センサの定義
	sensor_temp = machine.ADC(4)
	conversion_factor = 3.3 / (65535)

	while True:

		# 温度センサーの値を電圧に変換する
		reading = sensor_temp.read_u16() * conversion_factor

		# 基準値(27度)をもとに温度を算出
		temperature = 27 - (reading - 0.706)/0.001721

		# 温度を小数第二位以下四捨五入し、出力する
		print(str(round(temperature,1)) + " ℃")
		utime.sleep(5)

# ----------------------------------------------------------------
#  プログラム実行
# ----------------------------------------------------------------
try:
	init()
	main()

except KeyboardInterrupt:
#	GPIO.cleanup()
	pass

except Exception as ex:
#	GPIO.cleanup()
	print ("Exception:" + ex)